#include "config_param.h"

/********************************************************************************
 * 设置pid参数
 ********************************************************************************/

#define VERSION 13 /*13 表示V1.3*/

configParam_t configParam =
		{
				.version = VERSION, /*软件版本号*/

				.pidAngle = /*角度PID*/
				{
						.roll =
								{
										.kp = 8.0,
										.ki = 0.0,
										.kd = 0.0,
								},
						.pitch =
								{
										.kp = 8.0,
										.ki = 0.0,
										.kd = 0.0,
								},
						.yaw =
								{
										.kp = 20.0,
										.ki = 0.0,
										.kd = 1.5,
								},
				},
				.pidRate = /*角速度PID*/
				{
						.roll =
								{
										.kp = 300.0,
										.ki = 0.0,
										.kd = 6.5,
								},
						.pitch =
								{
										.kp = 300.0,
										.ki = 0.0,
										.kd = 6.5,
								},
						.yaw =
								{
										.kp = 200.0,
										.ki = 18.5,
										.kd = 0.0,
								},
				},
				.pidPos = /*位置PID*/
				{
						.vx =
								{
										.kp = 4.5,
										.ki = 0.0,
										.kd = 0.0,
								},
						.vy =
								{
										.kp = 4.5,
										.ki = 0.0,
										.kd = 0.0,
								},
						.vz =
								{
										.kp = 100.0,
										.ki = 150.0,
										.kd = 10.0,
								},

						.x =
								{
										.kp = 4.0,
										.ki = 0.0,
										.kd = 0.6,
								},
						.y =
								{
										.kp = 4.0,
										.ki = 0.0,
										.kd = 0.6,
								},
						.z =
								{
										.kp = 6.0,
										.ki = 0.0,
										.kd = 4.5,
								},
				},

				.trimP = 0.f,				 /*pitch微调*/
				.trimR = 0.f,				 /*roll微调*/
				.thrustBase = 34000, /*定高油门基础值*/
};
